Examinator/src/Enums/ТипыОбъектовСУЗ/ТипыОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбъектовСУЗ</name>
  <enumValues>
    <name>collection</name>
  </enumValues>
  <enumValues>
    <name>file</name>
  </enumValues>
  <enumValues>
    <name>frame</name>
  </enumValues>
  <enumValues>
    <name>glossary</name>
  </enumValues>
  <enumValues>
    <name>knowledgeBase</name>
  </enumValues>
  <enumValues>
    <name>map</name>
  </enumValues>
  <enumValues>
    <name>page</name>
  </enumValues>
  <enumValues>
    <name>question</name>
  </enumValues>
  <enumValues>
    <name>res</name>
  </enumValues>
  <enumValues>
    <name>term</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ЦелевыеОкнаДляСсылокСУЗ/ЦелевыеОкнаДляСсылокСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦелевыеОкнаДляСсылокСУЗ</name>
  <comment>Список окон в которых могут открываться ссылки</comment>
  <enumValues>
    <name>this</name>
  </enumValues>
  <enumValues>
    <name>new</name>
  </enumValues>
  <enumValues>
    <name>main</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/ПопыткаВыполненияПодборкиВопросовСУЗ/ПопыткаВыполненияПодборкиВопросовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПопыткаВыполненияПодборкиВопросовСУЗ</name>
  <registerRecords>InformationRegister.ТестыНаПроверкуСУЗ</registerRecords>
  <registerRecords>InformationRegister.ВопросыТестированийСУЗ</registerRecords>
  <registerRecords>InformationRegister.ПопыткиПрохожденияЭлектронныхРесурсовСУЗ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестЗавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>DefinedType.ВариантЗаданияЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СводЗнаний</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементСодержанияСводаЗнаний</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Подборка</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыполненияТеста</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВыполненияТеста</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговыйРезультат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяТеста</name>
    <comment>Отведенное на выполнение время теста</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТестирования</name>
    <type>
      <types>EnumRef.НазначенияТестированийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сложность</name>
    <type>
      <types>CatalogRef.СложностиТестовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБалловПсихологическихВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Вопросы</name>
    <attributes>
      <name>Вопрос</name>
      <type>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПсихологическийВопрос</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесВопроса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭлементПодборкиИзРубрикатора</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиИзРубрикатораСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыПодборки</name>
    <comment>Сохраняются группы подборки (элементы подборки верхнего уровня, которые образует ее страницы), которые были на момент начала сессии теста. В ссылках параметр numGroup</comment>
    <attributes>
      <name>ГруппаПодборки</name>
      <type>
        <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВсеВопросыОтвечены</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВопросыНаПроверку</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/СводыЗнанийСУЗ/СводыЗнанийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СводыЗнанийСУЗ</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РуководствоПользователя</name>
      <description>Руководство пользователя</description>
    </items>
  </predefined>
  <attributes>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Редакция</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтартоваяСтраница</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.КартыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаСУЗ</name>
    <type>
      <types>EnumRef.ТипыОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ШаблоныСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПоследнююВерсию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредпочитатьПоставщика</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыЭлектронныхРесурсовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоследовательнаяНавигация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Глоссарий</name>
    <type>
      <types>CatalogRef.ГлоссарииСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СправочнаяИнформация</name>
    <type>
      <types>CatalogRef.СтраницыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Базовый</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПервуюСсылкуНаТермин</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТерминВсплывающейПодсказкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БлокироватьНепройденное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПользовательскиеНастройки</name>
    <attributes>
      <name>ВидНастройки</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ВидыНастроекЭлектронныхРесурсовСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СкрытыеРесурсы</name>
    <attributes>
      <name>Ресурс</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыгружатьПриОткрытии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Размер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьГруппыПодчиненныхЭлементов</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ПодборкиСУЗ</types>
        <types>CatalogRef.ФреймыСУЗ</types>
        <types>CatalogRef.ТерминыСУЗ</types>
        <types>CatalogRef.СтраницыСУЗ</types>
        <types>CatalogRef.ГлоссарииСУЗ</types>
        <types>CatalogRef.РесурсыСУЗ</types>
        <types>CatalogRef.ВопросыСУЗ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ЭлементыПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПодборкиСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассификаторОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СодержаниеСУЗ/СодержаниеСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СодержаниеСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Карта</name>
    <type>
      <types>CatalogRef.КартыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаЭлемент</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <comment>Item / parameters</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>limitConditions / attemptLimit</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьПопытки</name>
    <comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВыполнения</name>
    <comment>completionThreshold</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИнициализации</name>
    <comment>dataFromLMS</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействиеПослеИстеченияВремени</name>
    <comment>timeLimitAction</comment>
    <type>
      <types>EnumRef.ДействияПослеИстеченияВремениВыполненияОбъектаSCORM</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьСсылкиНаТерминыГлоссария</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтменятьПользовательскиеНастройки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/CommonModules/ОбъектыСУЗПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБЪЕКТЫ

Функция ПолучитьПредставление(Ссылка, ПараметрыСсылки, КонтекстВыполнения) Экспорт
	Возврат ОбъектыСУЗ.ПолучитьПредставление(Ссылка, ПараметрыСсылки, КонтекстВыполнения);
КонецФункции

Функция ОбъектМожноПолучитьИзКэша(ИмяОбъекта, Ссылка) Экспорт
	
	Если ИмяОбъекта = "collection" Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЭтоТест") Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяОбъекта = "file" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "frame" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "glossary" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "knowledgeBase" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "map" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "page" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "question" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИмяОбъекта = "res" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ИмяОбъекта = "search" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ИмяОбъекта = "term" Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ТерминыГлоссария(Глоссарий, ПолучатьОпределение, Дата=Неопределено) Экспорт
	
	// Примечание: параметр Дата нужен для того, чтобы
	// Функция использовалась повторно только, пока открыта
	// Форма обозревателя. При повторном открытии формы, термины
	// Будут обновлены.
	
	Возврат Справочники.ГлоссарииСУЗ.Термины(Глоссарий, ПолучатьОпределение);
	
КонецФункции

Функция ИспользуютсяОграниченияНаДоступКЭлектроннымКурсам() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Если НЕ УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрофилиГруппДоступаВидыДоступа.Ссылка
		|ИЗ
		|	Справочник.ПрофилиГруппДоступа.ВидыДоступа КАК ПрофилиГруппДоступаВидыДоступа
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ПрофилиГруппДоступаВидыДоступа.ВидДоступа) = ТИП(Справочник.СводыЗнанийСУЗ)";
	
	Возврат НЕ Запрос.Выполнить().Пустой();	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// МОДУЛИ ОБЪЕКТОВ

Функция МодульПоИмени(ИмяМодуля) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем каталог файлов модуля
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФайлыСУЗ.Ссылка
		|ИЗ
		|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
		|ГДЕ
		|	ФайлыСУЗ.Владелец = ЗНАЧЕНИЕ(Справочник.РесурсыСУЗ.Модули)
		|	И ФайлыСУЗ.ЭтоГруппа = ИСТИНА
		|	И ФайлыСУЗ.Родитель = ЗНАЧЕНИЕ(Справочник.ФайлыСУЗ.ПустаяСсылка)
		|	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ
		|	И ФайлыСУЗ.Наименование = &ИмяМодуля";

	Запрос.УстановитьПараметр("ИмяМодуля", ИмяМодуля);
		
	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;	
	
	Возврат Неопределено;
	
КонецФункции

Функция ФайлыМодуля(Знач Модуль, Дата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Примечание: параметр Дата нужен для того, чтобы
	// Функция использовалась повторно только, пока открыта
	// Форма обозревателя. При повторном открытии формы,
	// Файлы модуля будут обновлены.
	
	Если ТипЗнч(Модуль) = Тип("Строка") Тогда
		Модуль = МодульПоИмени(Модуль);		
	КонецЕсли;
	
	ФайлыМодуля = Новый Массив();
	
	Если ЗначениеЗаполнено(Модуль) Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ФайлыСУЗ.Ссылка,
			|	ФайлыСУЗ.ИмяФайла
			|ИЗ
			|	Справочник.ФайлыСУЗ КАК ФайлыСУЗ
			|ГДЕ
			|	ФайлыСУЗ.Ссылка В ИЕРАРХИИ(&КаталогМодуля)
			|	И ФайлыСУЗ.ЭтоГруппа = ЛОЖЬ
			|	И ФайлыСУЗ.ПометкаУдаления = ЛОЖЬ";

		Запрос.УстановитьПараметр("КаталогМодуля", Модуль);

		Результат = Запрос.Выполнить();

		ВыборкаДетальныеЗаписи = Результат.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДанныеФайла = Новый Структура("Ссылка, ОтносительныйПуть, Расширение", ВыборкаДетальныеЗаписи.Ссылка, Справочники.ФайлыСУЗ.ПолучитьОтносительныйПутьКФайлу(ВыборкаДетальныеЗаписи.Ссылка), ОбщегоНазначенияСУКлиентСервер.РасширениеИмениФайла(ВыборкаДетальныеЗаписи.ИмяФайла));
			
			ФайлыМодуля.Добавить(ДанныеФайла);
			
		КонецЦикла;

	КонецЕсли;

	Возврат ФайлыМодуля;	
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПУТИ

Функция ИспользуетсяСовременныйБраузерВоВсехСлучаях() Экспорт
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.14.1") > 0;
КонецФункции

Функция ПрефиксКаталогаОбъекта()	
	
	Если ИспользуетсяСовременныйБраузерВоВсехСлучаях() Тогда
		Возврат "v8cache_14-";
	Иначе
		Возврат "v8cache_";
	КонецЕсли;
	
КонецФункции

Функция ПутьКаталогуОбъектов() Экспорт
	
	ПутьКРабочемуКаталогу = ПараметрыСеанса.ПутьКРабочемуКаталогуСУ;
	
	Если ЗначениеЗаполнено(ПутьКРабочемуКаталогу) Тогда
	
		НомерПакета = ПолучитьОбщийМакет("НомерБазовогоПакетаДанныхСУЗ").ПолучитьТекст();
		
		ПутьКаталогуОбъектов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПараметрыСеанса.ПутьКРабочемуКаталогуСУ) + ПрефиксКаталогаОбъекта() + НомерПакета;
		ПутьКаталогуОбъектов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПутьКаталогуОбъектов);
		
	КонецЕсли;
		
	Возврат ПутьКаталогуОбъектов;
	
КонецФункции

Функция АдресКаталогаОбъектов() Экспорт
	
	АдресРабочегоКаталога = АдресРабочегоКаталога(); 
	
	Если ЗначениеЗаполнено(АдресРабочегоКаталога) Тогда
	
		НомерПакета = ПолучитьОбщийМакет("НомерБазовогоПакетаДанныхСУЗ").ПолучитьТекст();
		
		АдресКаталогаОбъектов = АдресРабочегоКаталога + ПрефиксКаталогаОбъекта() + НомерПакета;
		АдресКаталогаОбъектов = ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(АдресКаталогаОбъектов);
		
	КонецЕсли;
		
	Возврат АдресКаталогаОбъектов;	
	
КонецФункции

Функция АдресРабочегоКаталога() Экспорт
	
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(ПараметрыСеанса.АдресРабочегоКаталогаСУ);
	
КонецФункции

Функция ПутьКОбщемуКаталогу() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Константы.ПутьКОбщемуКаталогуСУ.Получить());
	
КонецФункции

Функция АдресОбщегоКаталога() Экспорт
	
	Возврат ОбщегоНазначенияСУКлиентСервер.ДобавитьКонечныйРазделительПути(Константы.АдресОбщегоКаталогаСУ.Получить());
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ССЫЛКИ НА ОБЪЕКТЫ

// Служит для получения HTML ссылки на объект.
//
// Параметры:
//  СсылкаНаОбъект    - ссылка на элемент справочника объекта.
//  ЦелевоеОкно       - Значение перечисления ЦелевыеОкнаДляСсылокСУЗ.
//  Якорь             - Строка, дополнительный якорь ссылки.
//  ДопСвойстваСсылки - Структура, содержащая уточняющую информацию о ссылке,
//                      например какую страницу подборки показать.
//
// Возвращаемое значение:
// 	Строка, содержащая текст ссылки.
//
Функция СсылкаНаОбъектСУЗ(Знач СсылкаНаОбъект, Знач ЦелевоеОкно="this", Знач Якорь="", Знач ДопСвойстваСсылки=Неопределено) Экспорт
	
	Перем ТекстСсылки;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.СодержаниеСУЗ") Тогда
		
		Если ДопСвойстваСсылки = Неопределено Тогда
			ДопСвойстваСсылки = Новый Структура();
		КонецЕсли;
		
		ДопСвойстваСсылки.Вставить("ЭлементСодержания", СсылкаНаОбъект);
		
		Если СсылкаНаОбъект.ЭтоГруппа Тогда
			
			Если ЗначениеЗаполнено(СсылкаНаОбъект.Карта) Тогда
				Карта = СсылкаНаОбъект.Карта;
			Иначе
				Карта = Справочники.КартыСУЗ.АвтоКарта;
			КонецЕсли;
			
			Если ДопСвойстваСсылки = Неопределено Тогда
				ДопСвойстваСсылки = Новый Структура();
			КонецЕсли;
		
			ДопСвойстваСсылки.Вставить("ПредметКарты", СсылкаНаОбъект);
			ДопСвойстваСсылки.Вставить("ИмяПредметаКарты", "Folder");
			
			СсылкаНаОбъект = Карта;
			
		Иначе
			
			СсылкаНаОбъект = СсылкаНаОбъект.СсылкаНаЭлемент;
			
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.ЭлементыПодборкиСУЗ") Тогда
		
		Если ДопСвойстваСсылки = Неопределено Тогда
			ДопСвойстваСсылки = Новый Структура();
		КонецЕсли;
		
		ДопСвойстваСсылки.Вставить("ЭлементПодборки", СсылкаНаОбъект);
		
		СсылкаНаОбъект = СсылкаНаОбъект.Владелец;
		
	КонецЕсли;
	
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.СодержаниеГлоссарияСУЗ") Тогда
		
		Если ДопСвойстваСсылки = Неопределено Тогда
			ДопСвойстваСсылки = Новый Структура();
		КонецЕсли;
		
		ДопСвойстваСсылки.Вставить("БукваДляПоиска", СсылкаНаОбъект.ТерминГлоссария.БукваДляПоиска);
		
		СсылкаНаОбъект = СсылкаНаОбъект.Владелец;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
		Возврат "";
	КонецЕсли;
	
	ТипОбъекта = ОбъектыСУЗ.ПолучитьТипОбъектаСУЗ(СсылкаНаОбъект);
	
	ИмяОбъектаСУЗ = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ТипОбъекта);
		
	ТекстСсылки = "?id=" + СсылкаНаОбъект.УникальныйИдентификатор();
	ТекстСсылки = ТекстСсылки + "&object=" + ИмяОбъектаСУЗ;
		
	ИмяЦелевогоОкна = ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ЦелевоеОкно);
	Если НЕ ПустаяСтрока(ИмяЦелевогоОкна) Тогда
		ТекстСсылки = ТекстСсылки + "&window=" + ОбщегоНазначенияСУ.ИмяЗначенияПеречисления(ЦелевоеОкно);
	КонецЕсли;
		
	Если НЕ ПустаяСтрока(Якорь) Тогда
		ТекстСсылки = ТекстСсылки + "&anchor=" + Якорь;
	КонецЕсли;
		
	Если ТипОбъекта = Перечисления.ТипыОбъектовСУЗ.file Тогда
		ТекстСсылки = ТекстСсылки + "&action=openfile";
	КонецЕсли;
	
	Если ДопСвойстваСсылки <> Неопределено И ДопСвойстваСсылки.Свойство("БукваДляПоиска") Тогда
		ТекстСсылки = ТекстСсылки + "&letter=" + ДопСвойстваСсылки.БукваДляПоиска;
	КонецЕсли;
	
	Если (ИмяОбъектаСУЗ = "map" И НЕ ДопСвойстваСсылки=Неопределено) Тогда
		
		ПредметКарты = ДопСвойстваСсылки.ПредметКарты;
        ИдентификаторПредметаКарты = Строка(ПредметКарты.УникальныйИдентификатор());
		
		ТекстСсылки = ТекстСсылки + "&idTargetMap=" + ИдентификаторПредметаКарты;
		ТекстСсылки = ТекстСсылки + "&targetMap=" + ДопСвойстваСсылки.ИмяПредметаКарты;
		
		Если ДопСвойстваСсылки.Свойство("УровеньКарты") Тогда
			ТекстСсылки = ТекстСсылки + "&levelMap=" + ДопСвойстваСсылки.УровеньКарты;
		КонецЕсли;		
		
	КонецЕсли;
	
	Если (ИмяОбъектаСУЗ = "collection" И НЕ ДопСвойстваСсылки=Неопределено) Тогда  // Делаем ссылку на элемент подборки

		ЭлементПодборки = Справочники.ЭлементыПодборкиСУЗ.ПустаяСсылка();
		ДопСвойстваСсылки.Свойство("ЭлементПодборки", ЭлементПодборки);
		
		НомерГруппыПодборки = 0;
		ДопСвойстваСсылки.Свойство("НомерГруппыПодборки", НомерГруппыПодборки);
		
		ДокументСессии = Документы.ПопыткаВыполненияПодборкиВопросовСУЗ.ПустаяСсылка();
		ДопСвойстваСсылки.Свойство("ДокументСессии", ДокументСессии);
		
		НомерДокументаСессии = 0;
		ДопСвойстваСсылки.Свойство("НомерДокументаСессии", НомерДокументаСессии);
		
		Если ЗначениеЗаполнено(ЭлементПодборки) Тогда
			
			Если ДопСвойстваСсылки.Свойство("ПривязатьКИдентификаторуЭлементаПодборки") Тогда
				
				ТекстСсылки = ТекстСсылки + "&idGroup=" + ЭлементПодборки.УникальныйИдентификатор();
				
			Иначе
				
				Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ЭтоТест")
					ИЛИ ДопСвойстваСсылки.Свойство("РазрешенПереходКВопросамТеста") Тогда
					
					// Находим верхний по иерархии элемент подборки
					Если ЗначениеЗаполнено(ЭлементПодборки.Родитель) Тогда
						ГруппаПодборки = ЭлементПодборки.Родитель;
						Если ЗначениеЗаполнено(ГруппаПодборки.Родитель) Тогда
							ГруппаПодборки = ГруппаПодборки.Родитель
						КонецЕсли;
					Иначе
						ГруппаПодборки = ЭлементПодборки;
					КонецЕсли;
					
					НомерГруппыПодборки = Справочники.ПодборкиСУЗ.НомерГруппыПодборки(СсылкаНаОбъект, ГруппаПодборки);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерГруппыПодборки) Тогда
			ТекстСсылки = ТекстСсылки + "&numGroup=" + Формат(НомерГруппыПодборки, "ЧГ=0");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДокументСессии) Тогда
			НомерДокументаСессии = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСессии, "Номер");
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НомерДокументаСессии) Тогда
			
			НомерДокументаСессии = ОбщегоНазначенияСУКлиентСервер.ЧислоВСтроку(НомерДокументаСессии);
			
			ТекстСсылки = ТекстСсылки + "&numDocument=" + НомерДокументаСессии;			
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ДопСвойстваСсылки <> Неопределено И ДопСвойстваСсылки.Свойство("ЭлементСодержания") Тогда
		ТекстСсылки = ТекстСсылки + "&item=" + ДопСвойстваСсылки.ЭлементСодержания.УникальныйИдентификатор();
	КонецЕсли;
	
	Если ДопСвойстваСсылки <> Неопределено И ДопСвойстваСсылки.Свойство("ЭтоСкрытыйРесурс") И ДопСвойстваСсылки.ЭтоСкрытыйРесурс Тогда
		ТекстСсылки = ТекстСсылки + "&isHiddenRes=true";
	КонецЕсли;	
	
	Возврат ТекстСсылки;
	
КонецФункции

// Функция получает текстовую ссылку на элемент содержания свода знаний,
// который следует за переданным в функцию элементом или перед ним.
// Так же допускается поиск элемента по его id или идентификатору SCORM.
//
Функция СсылкаНаОбъектЭлементаСодержанияПоНавигационномуЗапросу(СводЗнаний, ТекущийЭлементСодержания=Неопределено, НавигационныйЗапрос) Экспорт
	
	//0. Получаем дерево содержания.
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	СодержаниеСУЗ.Ссылка КАК Ссылка,
	|	СодержаниеСУЗ.ЭтоГруппа,
	|	СодержаниеСУЗ.СсылкаНаЭлемент
	|ИЗ
	|	Справочник.СодержаниеСУЗ КАК СодержаниеСУЗ
	|ГДЕ
	|	СодержаниеСУЗ.Владелец = &Владелец
	|	И СодержаниеСУЗ.ПометкаУдаления = ЛОЖЬ

	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ,
	|	СодержаниеСУЗ.Код ИЕРАРХИЯ";

	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Владелец", СводЗнаний);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийЭлементСодержания)
		И ТипЗнч(НавигационныйЗапрос) = Тип("Строка") Тогда
		
		Выборка = Результат.Выбрать();
		
		// 1. Получаем следующую ссылку.
		Если НавигационныйЗапрос = "Следующий" Тогда
			
			Выборка.НайтиСледующий(ТекущийЭлементСодержания, "Ссылка");
			
			Если Выборка.НайтиСледующий(ЛОЖЬ, "ЭтоГруппа") Тогда
				АдресСсылки = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(Выборка.СсылкаНаЭлемент, Перечисления.ЦелевыеОкнаДляСсылокСУЗ.main);
				АдресСсылки = АдресСсылки + "&item=" + Строка(Выборка.Ссылка.УникальныйИдентификатор());
				Возврат АдресСсылки;
			Иначе
				Возврат "";
			КонецЕсли;
			
		// 2. Получаем предыдущую ссылку.
		Иначе
			
			ПредыдущийЭлемент         = Неопределено;
			ПредыдущаяСсылкаНаЭлемент = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.Ссылка = ТекущийЭлементСодержания Тогда
					Прервать;
				КонецЕсли;
				
				Если НЕ Выборка.ЭтоГруппа Тогда
					ПредыдущийЭлемент         = Выборка.Ссылка;
					ПредыдущаяСсылкаНаЭлемент = Выборка.СсылкаНаЭлемент;
				КонецЕсли;
			
			КонецЦикла;
			
			Если ПредыдущийЭлемент = Неопределено Тогда
				Возврат "";
			Иначе
				АдресСсылки = ОбъектыСУЗПовтИсп.СсылкаНаОбъектСУЗ(ПредыдущаяСсылкаНаЭлемент, Перечисления.ЦелевыеОкнаДляСсылокСУЗ.main);
				АдресСсылки = АдресСсылки + "&item=" + Строка(ПредыдущийЭлемент.УникальныйИдентификатор());
				Возврат АдресСсылки;
			КонецЕсли;
			
		КонецЕсли;
			
	Иначе
		Возврат "";
	КонецЕсли;
	
		
КонецФункции

// Возвращает адрес гиперссылки на элемент содержания.
//
// Примечание: Следует различать ссылку на элемент содержания 
// и ссылку на объект связанный с этим элементом.
// Если вдруг в процессе разработки, объект элемента содержания будет
// изменен, а элемент содержания останется как таковой, то ссылка
// на этот элемент содержания будет работать, а ссылка 
// на объект, который был когда то связан с этим элементом, уже не будет работать.
//
Функция СсылкаНаЭлементСодержания(ЭлементСодержания) Экспорт
	Возврат "?id=" + ЭлементСодержания.УникальныйИдентификатор() + "&action=openKnowledgeBaseElementLink";
КонецФункции

Функция СсылкаНаПодсказку(Подсказка) Экспорт
	Возврат "?id=" + Подсказка.УникальныйИдентификатор() + "&action=openTip";
КонецФункции
